{
  "backend/main.mo": "Main Motoko actor for the Tayari exam-prep app defining all data types (syllabus, GK, IQ, papers, exams, notes, videos, old questions, user profiles) and their in-memory storage, with access-control-gated CRUD functions for admin and user operations including bookmarks.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features in SplashScreen.tsx: applying mix-blend-mode to the TAYARI logo to remove its white background, and making the signature image smaller with mix-blend-mode to remove its black background box.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing one-to-two sentence summaries of all frontend source files, serving as a reference document for the project's frontend structure and component responsibilities.",
  "frontend/index.css": "Root CSS file with Tailwind directives and OKLCH-based CSS custom properties defining the full light and dark theme color system for the app.",
  "frontend/index.html": "HTML entry point for the Vite/React app, mounting the React root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that defines all TanStack Router routes (dashboard, syllabus, subject pages, bookmarks, exams, admin, etc.) and wraps the app in an AppErrorBoundary with a 3-second splash screen on first load.",
  "frontend/src/components/admin/ExamManagementForm.tsx": "Admin form for listing, adding, and deleting mock exams, collecting title, duration, description, and PDF URL fields.",
  "frontend/src/components/admin/GKManagementForm.tsx": "Admin tabbed form for managing General Knowledge content, supporting CRUD operations for topics, YouTube videos, and notes.",
  "frontend/src/components/admin/IQManagementForm.tsx": "Admin form component for managing IQ section content (categories, videos, and notes) with tabbed interface, add/delete operations, and toast notifications.",
  "frontend/src/components/admin/OldQuestionsManagementForm.tsx": "Admin form component for managing old question papers organized into First, Second, and Third paper types, supporting add/delete operations with Google Drive URL validation.",
  "frontend/src/components/admin/SecondPaperManagementForm.tsx": "Admin form component for managing Second Paper content (topics, videos, and notes) with a tabbed interface, YouTube URL validation, and toast notifications.",
  "frontend/src/components/admin/StandaloneNoteManagementForm.tsx": "Admin form component for managing standalone notes with title, description, and Google Drive URL fields, supporting add and delete operations.",
  "frontend/src/components/admin/StandaloneVideoManagementForm.tsx": "Admin form component for managing standalone videos with title, description, and YouTube URL fields, supporting add and delete operations with toast feedback.",
  "frontend/src/components/admin/SyllabusManagementForm.tsx": "Admin form component for managing syllabus entries, allowing admins to add new entries (title, description, Drive URL) and delete existing ones with toast notifications for feedback.",
  "frontend/src/components/admin/ThirdPaperManagementForm.tsx": "Admin form component with tabbed interface for managing third paper content, supporting CRUD operations for topics, YouTube videos, and notes with validation and toast notifications.",
  "frontend/src/components/AdminGuard.tsx": "Route guard component that checks Internet Identity authentication and admin status, showing a loading spinner, unauthenticated message, or access-denied screen before rendering protected admin children.",
  "frontend/src/components/AppErrorBoundary.tsx": "React class-based error boundary that catches render errors, logs them to the console, and displays a user-friendly fallback UI with a reload button.",
  "frontend/src/components/AppLogo.tsx": "Logo image component that displays the generated 3D globe PNG and falls back to the Thah Study logo if the primary image fails to load.",
  "frontend/src/components/AuthControls.tsx": "Authentication button component that toggles between Login and Logout using Internet Identity, clearing the React Query cache on logout.",
  "frontend/src/components/BottomNav.tsx": "Renders a fixed bottom navigation bar with links to Home, Videos, Notes, Exam, and optionally an Admin page if the authenticated user is an admin.",
  "frontend/src/components/CourseImageCarousel.tsx": "Displays an auto-advancing image carousel with manual previous/next navigation buttons and dot indicators.",
  "frontend/src/components/DriveViewer.tsx": "Embeds a Google Drive file or folder in an iframe and provides buttons to open it externally or save it to the offline library.",
  "frontend/src/components/SoundPlayer.tsx": "A headless audio component that plays an exam-finish bell sound when the `play` prop becomes true.",
  "frontend/src/components/TopicVideoList.tsx": "Renders a scrollable list of topics and their videos, allowing selection and bookmark toggling for each video.",
  "frontend/src/components/YouTubePlayer.tsx": "Converts various YouTube URL formats (watch, short, live, playlist) into an embedded responsive iframe player.",
  "frontend/src/content/exams.ts": "Defines static exam set data including IDs, titles, Google Drive URLs, and durations for three exam papers (first, second, third), with first paper marked as coming soon.",
  "frontend/src/content/gk.ts": "Static content configuration for the General Knowledge subject, defining topics such as Solar System, World/Nepal Geography, and History, each with associated YouTube video links.",
  "frontend/src/content/iq.ts": "Static content configuration for the IQ subject, organizing topics like verification, classification, analogy, and filing aptitude tests with associated YouTube video links.",
  "frontend/src/content/oldQuestions.ts": "Static data for old exam questions organized by paper (first, second, third) and year, each entry containing Google Drive URLs or a coming-soon flag.",
  "frontend/src/content/secondPaper.ts": "Static content configurations for second paper subjects including Office Management and Constitution, each with topics and associated YouTube video links and Google Drive notes URLs.",
  "frontend/src/content/syllabus.ts": "Exports an array of syllabus link objects for Nepal's provinces, each with an id, title, and Google Drive URL(s), with Sudurpashchim Pradesh marked as coming soon.",
  "frontend/src/content/thirdPaper.ts": "Defines and exports a SubjectConfig object for a 'Service Management' subject, containing topic titles with associated YouTube video links and a notes Google Drive URL.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useBookmarks.ts": "Custom React hook managing video and note bookmarks with localStorage persistence and backend sync via the actor, merging local and server bookmarks upon authentication.",
  "frontend/src/hooks/useCountdownTimer.ts": "Custom React hook providing a countdown timer with start, stop, and reset controls, a formatted time string, and an optional callback on completion.",
  "frontend/src/hooks/useExamManagement.ts": "Custom React hook for managing mock exams via the backend actor, exposing queries and mutations for fetching, adding, and deleting exams using React Query.",
  "frontend/src/hooks/useGKManagement.ts": "Custom React hook for managing General Knowledge topics, videos, and notes via the backend actor, providing React Query-based fetch and mutation operations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, including login, logout, and identity persistence via AuthClient with configurable options.",
  "frontend/src/hooks/useIQManagement.ts": "Custom React hook for managing IQ categories, videos, and notes via the backend actor, providing React Query-based fetch and mutation operations.",
  "frontend/src/hooks/useNotifications.ts": "Custom hook that manages a list of notifications stored in localStorage, providing read/unread state and a markAsRead function.",
  "frontend/src/hooks/useOfflineLibrary.ts": "Custom hook that manages an offline library of documents, videos, and notes persisted in localStorage, with add and remove operations.",
  "frontend/src/hooks/useOldQuestionsManagement.ts": "Custom hook for fetching, adding, and deleting old exam questions via the backend actor using React Query mutations and queries.",
  "frontend/src/hooks/useQueries.ts": "Custom hook that queries the backend actor to check if the current caller has admin privileges, caching the result for 5 minutes.",
  "frontend/src/hooks/useSecondPaperManagement.ts": "Custom hook for managing second paper topics, videos, and notes via backend actor calls using React Query for fetching and mutations.",
  "frontend/src/hooks/useStandaloneNoteManagement.ts": "Custom hook for fetching, adding, and deleting standalone notes via the backend actor using React Query.",
  "frontend/src/hooks/useStandaloneVideoManagement.ts": "Custom hook for fetching, adding, and deleting standalone videos via the backend actor using React Query.",
  "frontend/src/hooks/useSyllabusManagement.ts": "Custom hook for fetching, adding, and deleting syllabus entries via the backend actor using React Query.",
  "frontend/src/hooks/useThirdPaperManagement.ts": "Custom hook for managing third paper topics, videos, and notes via backend actor calls using React Query for fetching and mutations.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives, defines light/dark mode CSS custom properties using OKLCH color values, and declares utility animation keyframes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider into the DOM root.",
  "frontend/src/pages/AdminPanel.tsx": "Admin panel page protected by AdminGuard that renders tabbed management forms for syllabus, GK, IQ, second/third paper, old questions, exams, videos, and notes content.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying subject navigation cards grouped by exam paper, a course image carousel, notification bell with unread count, and a bottom navigation bar.",
  "frontend/src/pages/Exam.tsx": "Mock exam page that lets users select and start timed exams, displays a countdown timer with a DriveViewer for exam content, and shows a completion screen with sound when time expires.",
  "frontend/src/pages/NotesBookmarks.tsx": "Page that lists the user's bookmarked notes fetched via useBookmarks, with the ability to remove individual bookmarks.",
  "frontend/src/pages/Notifications.tsx": "Notifications page that displays update and exam-date notifications in separate sections, highlighting unread items and marking them as read on click.",
  "frontend/src/pages/OfflineLibrary.tsx": "Offline library page that lists saved items from useOfflineLibrary, allowing users to open them externally or remove them from the library.",
  "frontend/src/pages/OldQuestions.tsx": "Old questions page with tabs for first, second, and third exam papers, letting users select a paper to view via DriveViewer or showing a 'coming soon' state.",
  "frontend/src/pages/SplashScreen.tsx": "Displays a full-screen animated splash/intro page with a teal gradient background, the TAYARI logo, app title in Nepali, and a signature image with mix-blend-mode applied to blend with the gradient.",
  "frontend/src/pages/SubjectContent.tsx": "Renders a subject's video and notes content page with a searchable topic/video list, YouTube player, Drive viewer for notes, and bookmark support; uses a resizable panel layout for desktop.",
  "frontend/src/pages/Syllabus.tsx": "Displays a list of syllabus items loaded from content config; clicking an item opens a DriveViewer to show the syllabus document, with 'coming soon' support for unavailable items.",
  "frontend/src/pages/VideoBookmarks.tsx": "Shows the user's bookmarked videos with search filtering and the ability to remove bookmarks; includes a bottom navigation bar and auth controls.",
  "frontend/src/types/content.ts": "Defines TypeScript interfaces for Video, Topic, and SubjectConfig used throughout the content-related components.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/src/utils/videoSearch.ts": "Exports a filterVideosByKeyword function that filters topics and their videos by a case-insensitive keyword, returning only matching topics or topics with matching videos.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color tokens, border radius variables, accordion keyframes, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project state for the TAYARI app, documenting known issues (logo and signature background blending on the splash screen) and existing fix features applied in SplashScreen.tsx."
}