{
  "backend/main.mo": "Motoko canister implementing user profiles and video/note bookmark storage with permission checks and admin/user access control.",
  "feature_evidence.json": "Feature evidence report listing UI modification features, affected files, components, and associated test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing their purpose, behavior, and UI roles.",
  "frontend/index.css": "Tailwind base styles defining CSS variables for light/dark themes and applying global background and text color rules.",
  "frontend/index.html": "Root HTML file that loads the React app by mounting main.tsx into the #root element.",
  "frontend/src/App.tsx": "Main React router setup defining all app routes, splash screen handling, and root layout wrapped in an error boundary.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that catches runtime errors, logs them, and displays a reloadable fallback UI.",
  "frontend/src/components/AppLogo.tsx": "Logo component that loads the primary PNG logo with automatic fallback to a backup image on load failure.",
  "frontend/src/components/AuthControls.tsx": "Authentication button component handling login/logout via Internet Identity with error handling and query cache clearing.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar with Nepali labels that highlights the active route and provides quick navigation to key pages.",
  "frontend/src/components/CourseImageCarousel.tsx": "Implements an auto-advancing image carousel with manual navigation and slide indicators.",
  "frontend/src/components/DriveViewer.tsx": "Embeds Google Drive files or folders with fallback handling and supports offline saving and external opening.",
  "frontend/src/components/SoundPlayer.tsx": "Simple audio player that auto-plays a bell sound when triggered and notifies on end.",
  "frontend/src/components/TopicVideoList.tsx": "Displays categorized video topics with selection highlighting and bookmarking support.",
  "frontend/src/components/YouTubePlayer.tsx": "Renders a responsive YouTube iframe supporting video, live, and playlist URLs.",
  "frontend/src/content/exams.ts": "Defines exam sets with metadata such as titles, durations, and associated Drive URLs.",
  "frontend/src/content/gk.ts": "Provides General Knowledge subject configuration including notes and categorized YouTube video topics.",
  "frontend/src/content/iq.ts": "Provides IQ subject configuration containing multiple categorized video topics.",
  "frontend/src/content/oldQuestions.ts": "Lists past exam questions by paper with optional Drive URLs and coming-soon markers.",
  "frontend/src/content/secondPaper.ts": "Defines subject configs for office management and constitution, listing topics with associated video links and notes URLs.",
  "frontend/src/content/syllabus.ts": "Exports an array of syllabus link objects for different provinces and combined syllabi.",
  "frontend/src/content/thirdPaper.ts": "Defines subject config for service management, including multiple topics with video resources and notes URL.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useBookmarks.ts": "Manages video and note bookmarks with local storage and syncs them to the backend when authenticated.",
  "frontend/src/hooks/useCountdownTimer.ts": "Provides a countdown timer hook with start, stop, reset, and formatted time output.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling login, stored identities, and exposing auth state to components.",
  "frontend/src/hooks/useNotifications.ts": "Loads, stores, and updates app notifications in local storage with unread count management.",
  "frontend/src/hooks/useOfflineLibrary.ts": "Handles an offline library of saved items, supporting add, remove, and persistence via local storage.",
  "frontend/src/index.css": "Sets Tailwind layers, defines extensive light/dark theme CSS variables, adds utility animations, and applies global background and typography styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global CSS.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard with course sections, subject shortcuts, a header with search and notifications, and a carousel.",
  "frontend/src/pages/Exam.tsx": "Implements mock exam flow including exam selection, timer handling, viewing exam files, and displaying completion UI.",
  "frontend/src/pages/NotesBookmarks.tsx": "Displays bookmarked notes with delete controls and navigation, using bookmark state from a custom hook.",
  "frontend/src/pages/Notifications.tsx": "Lists categorized notifications, marking items as read when clicked.",
  "frontend/src/pages/OfflineLibrary.tsx": "Shows offline-saved items with options to open or remove them.",
  "frontend/src/pages/OldQuestions.tsx": "Renders old exam questions with tabbed papers and opens selected items in a Drive viewer.",
  "frontend/src/pages/SplashScreen.tsx": "Displays a full‑screen animated splash screen with logo and branding text.",
  "frontend/src/pages/SubjectContent.tsx": "Shows subject videos, notes, and search with a resizable layout and bookmark support.",
  "frontend/src/pages/Syllabus.tsx": "Lists syllabus items and opens selected ones in a Drive viewer with a styled card layout.",
  "frontend/src/pages/VideoBookmarks.tsx": "Displays and filters bookmarked videos with delete actions and navigation controls.",
  "frontend/src/types/content.ts": "Defines interfaces for videos, topics, and subject configuration.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, persist, and clear URL and session parameters.",
  "frontend/src/utils/videoSearch.ts": "Filters topics and videos based on a case‑insensitive keyword search.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors via CSS variables, extended animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project state, including app requirements, architecture notes, issues, and existing feature definitions for an exam‑prep mobile app."
}