{
  "backend/main.mo": "Motoko canister implementing authorization‑protected user profiles and per‑user video/note bookmark storage using Maps and Sets.",
  "feature_evidence.json": "Feature evidence report mapping feature requests to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Pre‑generated summaries of all frontend source files describing their purpose and behavior.",
  "frontend/index.css": "Tailwind base styles defining OKLCH‑based light/dark theme variables and global background/foreground behavior.",
  "frontend/index.html": "Root HTML document containing the app mount point and script loader for the React application.",
  "frontend/src/App.tsx": "Main React app that defines all routes, loads subject configs, and shows a splash screen before rendering the router.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that logs caught errors and displays a reloadable fallback UI when crashes occur.",
  "frontend/src/components/AppLogo.tsx": "Logo component rendering a primary PNG with automatic fallback to a secondary image on load failure.",
  "frontend/src/components/AuthControls.tsx": "Authentication control button that handles Internet Identity login/logout and clears client cache on logout.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with four main tabs highlighting the active route using TanStack Router state.",
  "frontend/src/components/CourseImageCarousel.tsx": "Image carousel that auto-advances slides and provides manual navigation with indicators.",
  "frontend/src/components/DriveViewer.tsx": "Displays Google Drive files with an embedded viewer, fallback handling, and offline save support.",
  "frontend/src/components/SoundPlayer.tsx": "Simple audio player that auto-plays a sound when triggered and fires an optional end callback.",
  "frontend/src/components/TopicVideoList.tsx": "Scrollable list of topic videos with selectable items and bookmark toggling.",
  "frontend/src/components/YouTubePlayer.tsx": "Embeds YouTube videos or playlists by converting URLs to proper embed links.",
  "frontend/src/content/exams.ts": "Defines configuration for exam sets including IDs, titles, durations, and Google Drive URLs.",
  "frontend/src/content/gk.ts": "General Knowledge subject config listing topics and associated YouTube videos and notes.",
  "frontend/src/content/iq.ts": "IQ subject config defining multiple test categories with linked YouTube videos.",
  "frontend/src/content/oldQuestions.ts": "Data for old exam questions per paper, including years, availability, and Drive URLs.",
  "frontend/src/content/secondPaper.ts": "Defines subject configs for office management and constitution, including topics, video lists, and notes URLs.",
  "frontend/src/content/syllabus.ts": "Exports a list of syllabus link objects for different provinces and categories, some with coming-soon flags.",
  "frontend/src/content/thirdPaper.ts": "Defines service management subject config with multiple topics and associated educational video links.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useBookmarks.ts": "Manages local and cloud-synced bookmarks for videos and notes, merging and storing data across sessions.",
  "frontend/src/hooks/useCountdownTimer.ts": "Provides a countdown timer hook with start, stop, reset, and formatted time output.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for login, identity persistence, and auth-client configuration.",
  "frontend/src/hooks/useNotifications.ts": "Loads, stores, and updates user notifications with read status tracking in local storage.",
  "frontend/src/hooks/useOfflineLibrary.ts": "Handles a local offline library of documents, videos, and notes with add and remove operations stored in local storage.",
  "frontend/src/index.css": "Defines Tailwind layers, theme CSS variables for light/dark modes, utility animations, and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/Dashboard.tsx": "Renders the dashboard with header, course sections, subject shortcuts, image carousel, and notifications badge.",
  "frontend/src/pages/Exam.tsx": "Implements mock exam flow with timer, exam selection, PDF viewer, and completion screen with sound alert.",
  "frontend/src/pages/NotesBookmarks.tsx": "Displays bookmarked notes with delete controls and navigation, using stored bookmark state.",
  "frontend/src/pages/Notifications.tsx": "Shows categorized notifications and allows marking items as read.",
  "frontend/src/pages/OfflineLibrary.tsx": "Lists saved offline items with open and delete actions, or an empty-state message.",
  "frontend/src/pages/OldQuestions.tsx": "Renders old question papers with tabbed navigation and opens selected papers in a Drive viewer.",
  "frontend/src/pages/SplashScreen.tsx": "Displays a full‑screen animated splash screen with a logo and title before the app loads.",
  "frontend/src/pages/SubjectContent.tsx": "Shows subject videos, notes, and search with resizable panels and bookmark support.",
  "frontend/src/pages/Syllabus.tsx": "Lists syllabus items and opens selected ones in a Drive viewer, with coming‑soon handling.",
  "frontend/src/pages/VideoBookmarks.tsx": "Displays and filters bookmarked videos with options to remove bookmarks.",
  "frontend/src/types/content.ts": "Defines interfaces for videos, topics, and subject configuration.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session parameters.",
  "frontend/src/utils/videoSearch.ts": "Filters topics and videos by a search keyword, returning only matching items.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom OKLCH color tokens, extended theme settings, animations, and core plugins.",
  "project_state.json": "Project metadata describing app requirements, architecture notes, issues, image needs, and existing implemented features."
}