{
  "backend/main.mo": "Main backend actor defining types for syllabus, GK, IQ, second/third paper content, exams, videos, notes, and user profiles; includes authorization mixin, storage using Lists and Maps, and a comment system with role-based access control.",
  "feature_evidence.json": "Feature evidence report documenting implemented admin panel features including navigation, content management forms for syllabus/GK/IQ/second paper/third paper sections, with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, content configuration, UI components, hooks for bookmarks and authentication, pages for dashboard/subjects/exams/admin, and styling with Tailwind and OKLCH color system.",
  "frontend/index.css": "Global stylesheet with Tailwind directives, OKLCH-based CSS custom properties for light/dark theme colors, and base styles for background and foreground colors.",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title for Tayari exam-preparation app, and script tag loading the React app from main.tsx.",
  "frontend/src/App.tsx": "Main app component with TanStack Router setup defining routes for dashboard, syllabus, subjects (GK/IQ/second paper/third paper), bookmarks, exams, admin panel, and other pages, wrapped in error boundary with 3-second splash screen.",
  "frontend/src/components/admin/ExamManagementForm.tsx": "Admin form for adding and deleting mock exams with fields for title, duration, description, and PDF URL, displaying a list of existing exams with delete functionality.",
  "frontend/src/components/admin/GKManagementForm.tsx": "Admin interface with tabs for managing GK (General Knowledge) topics and videos, providing forms to add/delete topics and videos with YouTube URLs.",
  "frontend/src/components/admin/IQManagementForm.tsx": "Admin form component for managing IQ categories and videos with tabs, allowing creation and deletion of both resource types using the useIQManagement hook.",
  "frontend/src/components/admin/SecondPaperManagementForm.tsx": "Admin form component for managing Second Paper topics, videos, and notes with three tabs, enabling CRUD operations via the useSecondPaperManagement hook.",
  "frontend/src/components/admin/StandaloneNoteManagementForm.tsx": "Admin form component for managing standalone notes with Google Drive URLs, providing add/delete functionality through the useStandaloneNoteManagement hook.",
  "frontend/src/components/admin/StandaloneVideoManagementForm.tsx": "Admin form component for managing standalone videos with YouTube URLs, offering add/delete operations via the useStandaloneVideoManagement hook.",
  "frontend/src/components/admin/SyllabusManagementForm.tsx": "Admin form component for managing syllabus entries with Google Drive URLs and publish status, using the useSyllabusManagement hook for CRUD operations.",
  "frontend/src/components/admin/ThirdPaperManagementForm.tsx": "Admin form component for managing Third Paper content (topics, videos, notes) with tabs, input fields, and CRUD operations using a custom hook and toast notifications.",
  "frontend/src/components/AdminGuard.tsx": "Authentication guard component that checks user identity and admin status, showing loading/login/access-denied states or rendering children for authenticated admins.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary class component that catches render errors, logs them with full stack traces, and displays a user-friendly fallback UI with reload button.",
  "frontend/src/components/AppLogo.tsx": "Displays the application logo with fallback support, attempting to load a 3D education globe logo and falling back to the Thah Study logo on error.",
  "frontend/src/components/AuthControls.tsx": "Provides login/logout button controls using Internet Identity authentication, with query cache clearing on logout and error handling for authentication state conflicts.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with tabs for Home, Videos, Notes, Exam, and conditionally Admin (for admin users), displaying Nepali labels and highlighting the active route.",
  "frontend/src/components/CourseImageCarousel.tsx": "Auto-advancing image carousel with manual navigation controls, displaying course images with indicators and cycling through images at a configurable interval.",
  "frontend/src/components/DriveViewer.tsx": "Embeds Google Drive files/folders with fallback to external links, includes download functionality that saves items to offline library.",
  "frontend/src/components/SoundPlayer.tsx": "Audio player component that plays an exam finish bell sound when triggered, with error handling and an optional callback on playback completion.",
  "frontend/src/components/TopicVideoList.tsx": "Displays a scrollable list of videos organized by topics, with video selection, bookmark toggling, and visual indication of the currently selected video.",
  "frontend/src/components/YouTubePlayer.tsx": "Embeds YouTube videos or playlists in a responsive 16:9 iframe, parsing various YouTube URL formats to extract video/playlist IDs.",
  "frontend/src/content/exams.ts": "Defines exam sets for three papers with titles, Google Drive URLs, durations, and coming-soon flags.",
  "frontend/src/content/gk.ts": "General Knowledge subject configuration with topics covering Solar System, Geography, History, Social/Economic aspects, Science/Technology, and associated YouTube video links.",
  "frontend/src/content/iq.ts": "IQ subject configuration with topics on verification tests, completion, classification, analogy, filing aptitude, and instruction-following, each with multiple YouTube video links.",
  "frontend/src/content/oldQuestions.ts": "Old question papers organized by paper type (first, second, third) and year (2078-2083), with Google Drive URLs and coming-soon flags.",
  "frontend/src/content/secondPaper.ts": "Second Paper subject configurations for Office Management and Constitution, each with topics, notes URLs, and YouTube video links.",
  "frontend/src/content/syllabus.ts": "Syllabus links for all provinces and general syllabus parts, each with Google Drive URLs and optional coming-soon flags.",
  "frontend/src/content/thirdPaper.ts": "Defines the service management subject configuration with topics covering civil service, public service flow, public charter, good governance act, right to information, anti-corruption act, federal/local level governance, food rights act, and personal event registration, each with associated video content.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and initializing access control with admin token from URL parameters.",
  "frontend/src/hooks/useBookmarks.ts": "React hook managing video and note bookmarks with local storage persistence and cloud sync when authenticated, merging local and server bookmarks on login.",
  "frontend/src/hooks/useCountdownTimer.ts": "React hook providing countdown timer functionality with start, stop, reset controls and formatted time display, executing a callback on completion.",
  "frontend/src/hooks/useExamManagement.ts": "React hook for managing mock exams using React Query, providing queries for fetching exams and mutations for adding/deleting exams via the backend actor.",
  "frontend/src/hooks/useGKManagement.ts": "React hook for managing general knowledge topics and videos using React Query, providing CRUD operations for both GK topics and videos via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing auth client creation, login flow, identity state, and providing authentication status throughout the application.",
  "frontend/src/hooks/useIQManagement.ts": "React hook for managing IQ test categories and videos using React Query, providing CRUD operations for both IQ categories and videos via the backend actor.",
  "frontend/src/hooks/useNotifications.ts": "React hook managing app notifications with local storage persistence, providing default notifications for updates and exams with read/unread tracking.",
  "frontend/src/hooks/useOfflineLibrary.ts": "Custom React hook that manages an offline library of documents, videos, and notes stored in localStorage. Provides methods to add and remove items from the library.",
  "frontend/src/hooks/useQueries.ts": "Custom React hook that uses TanStack Query to check if the current user is an admin by calling the actor's isCallerAdmin method.",
  "frontend/src/hooks/useSecondPaperManagement.ts": "Custom React hook that manages second paper topics, videos, and notes using TanStack Query. Provides queries to fetch data and mutations to add/delete items with automatic cache invalidation.",
  "frontend/src/hooks/useStandaloneNoteManagement.ts": "Custom React hook that manages standalone notes using TanStack Query. Provides queries to fetch notes and mutations to add/delete notes with automatic cache invalidation.",
  "frontend/src/hooks/useStandaloneVideoManagement.ts": "Custom React hook that manages standalone videos using TanStack Query. Provides queries to fetch videos and mutations to add/delete videos with automatic cache invalidation.",
  "frontend/src/hooks/useSyllabusManagement.ts": "Custom React hook that manages syllabus entries using TanStack Query. Provides queries to fetch entries and mutations to add/delete entries with automatic cache invalidation.",
  "frontend/src/hooks/useThirdPaperManagement.ts": "Custom React hook that manages third paper topics, videos, and notes using TanStack Query. Provides queries to fetch data and mutations to add/delete items with automatic cache invalidation.",
  "frontend/src/index.css": "Global CSS file with Tailwind directives, custom CSS variables for theming (light/dark mode), and keyframe animations for enter, fade-in, and slide-in effects. Defines color schemes using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for TanStack Query and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin panel page with tabs for managing syllabus, GK, IQ, second/third paper content, exams, videos, and notes. Protected by AdminGuard and includes navigation header and bottom nav.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying course carousel, first/second/third paper subjects with icons and gradient colors, and navigation to various sections. Includes header with search, notifications bell, and bottom navigation.",
  "frontend/src/pages/Exam.tsx": "Exam page component that displays a list of mock exams, allows users to start timed exams with countdown timer, shows Google Drive embedded exam content, and displays completion screen with sound notification.",
  "frontend/src/pages/NotesBookmarks.tsx": "Notes bookmarks page that displays a list of bookmarked notes with delete functionality, showing empty state when no bookmarks exist.",
  "frontend/src/pages/Notifications.tsx": "Notifications page that displays categorized notifications (updates and exam dates) with read/unread status and mark-as-read functionality.",
  "frontend/src/pages/OfflineLibrary.tsx": "Offline library page that displays saved items (notes and question papers) for offline access with remove and external link functionality.",
  "frontend/src/pages/OldQuestions.tsx": "Old questions page with tabbed interface for three exam papers, displays question paper lists and opens Google Drive viewer for selected papers.",
  "frontend/src/pages/SplashScreen.tsx": "Animated splash screen component with logo, app title 'Kharidar Tayari', loading animation, and creator credit.",
  "frontend/src/pages/SubjectContent.tsx": "Subject content page with resizable desktop layout showing video player, searchable topic list with bookmarks, and tabbed interface for videos and notes with Google Drive viewer.",
  "frontend/src/pages/Syllabus.tsx": "Syllabus page component that displays a list of syllabus items from syllabusLinks config and allows viewing selected syllabus documents via DriveViewer component.",
  "frontend/src/pages/VideoBookmarks.tsx": "Video bookmarks page that displays user's bookmarked videos with search functionality and delete capability, using the useBookmarks hook for state management.",
  "frontend/src/types/content.ts": "TypeScript type definitions for content structure including Video, Topic, and SubjectConfig interfaces used throughout the app.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters and session storage, supporting both hash-based and browser-based routing.",
  "frontend/src/utils/videoSearch.ts": "Utility function that filters topics and videos by keyword search, returning only topics with matching titles or videos.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended theme settings, animations, and plugins for typography and container queries.",
  "project_state.json": "Project metadata tracking architectural notes, existing features, and requirements for the Nepali exam preparation app with admin panel for content management across multiple sections."
}