{
  "backend/main.mo": "Main Motoko actor defining all data types (syllabus, GK, IQ, papers, exams, videos, notes, old questions, user profiles, bookmarks) and storage structures with access control integration for the Tayari exam preparation backend.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features related to adding and verifying prominent Add buttons with shadow and mix colors across management forms (Syllabus, StandaloneVideo, StandaloneNote).",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, content configuration, styling, components, hooks, pages, and utilities for the Tayari exam preparation app.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for background, foreground, primary, secondary, muted, accent, destructive, border, and sidebar colors.",
  "frontend/index.html": "HTML entry point with viewport meta tag and root div mounting the React app via main.tsx, titled for the Tayari exam-preparation app.",
  "frontend/src/App.tsx": "Main React app component configuring TanStack Router with routes for dashboard, syllabus, subjects (GK, IQ, papers), bookmarks, old questions, exams, offline library, admin panel, and notifications, wrapped in error boundary with 3-second splash screen.",
  "frontend/src/components/admin/ExamManagementForm.tsx": "Admin form for managing mock exams with add/delete operations, including title, duration, description, and PDF URL fields.",
  "frontend/src/components/admin/GKManagementForm.tsx": "Admin form with tabs for managing GK content (topics, videos, notes) with add/delete operations and validation for each content type.",
  "frontend/src/components/admin/IQManagementForm.tsx": "Admin form component for managing IQ-related content with tabs for categories, videos, and notes. Provides CRUD operations with validation, toast notifications, and uses the useIQManagement hook.",
  "frontend/src/components/admin/OldQuestionsManagementForm.tsx": "Admin form component for managing old question papers organized by paper type (First, Second, Third). Handles adding/deleting question papers with PDF URLs and years, validates Google Drive URLs.",
  "frontend/src/components/admin/SecondPaperManagementForm.tsx": "Admin form component for managing second paper content with tabs for topics, videos, and notes. Provides CRUD operations with YouTube URL validation and uses the useSecondPaperManagement hook.",
  "frontend/src/components/admin/StandaloneNoteManagementForm.tsx": "Admin form component for managing standalone notes with title, description, and Google Drive URL. Provides add/delete functionality with validation and toast notifications.",
  "frontend/src/components/admin/StandaloneVideoManagementForm.tsx": "Admin form component for managing standalone videos with title, description, and YouTube URL. Provides add/delete functionality with validation and toast notifications.",
  "frontend/src/components/admin/SyllabusManagementForm.tsx": "Admin form component for managing syllabus entries with add/delete functionality, form validation, and toast notifications using a custom hook.",
  "frontend/src/components/admin/ThirdPaperManagementForm.tsx": "Admin form component with tabbed interface for managing third paper topics, videos, and notes with CRUD operations and YouTube URL validation.",
  "frontend/src/components/AdminGuard.tsx": "React component that guards admin routes by checking authentication and admin privileges, showing loading states, authentication prompts, or access denied messages as appropriate.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary class component that catches render errors, logs full stack traces to console, and displays a user-friendly fallback UI with error message and reload button.",
  "frontend/src/components/AppLogo.tsx": "Logo component displaying the 3D education globe PNG from /assets/generated/app-logo.dim_512x512.png with automatic fallback to Thah Study logo on load error.",
  "frontend/src/components/AuthControls.tsx": "Authentication button component toggling between Login/Logout states using Internet Identity, clearing query cache on logout and handling authentication errors gracefully.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar component with Home, Video, Notes, Exam tabs (and Admin for admins), using TanStack Router for navigation and highlighting the active route.",
  "frontend/src/components/CourseImageCarousel.tsx": "Image carousel component with auto-advance, manual navigation buttons, and dot indicators for displaying multiple course images.",
  "frontend/src/components/DriveViewer.tsx": "Google Drive document/folder viewer with embed support, fallback to external link, and offline download functionality.",
  "frontend/src/components/SoundPlayer.tsx": "Audio player component that plays an exam finish bell sound when triggered, with error handling for playback failures.",
  "frontend/src/components/TopicVideoList.tsx": "Scrollable list of videos grouped by topics with selection highlighting and bookmark toggle functionality.",
  "frontend/src/components/YouTubePlayer.tsx": "YouTube video embed player that extracts video IDs from various YouTube URL formats and renders an iframe player.",
  "frontend/src/content/exams.ts": "Defines exam sets data structure with IDs, titles, Google Drive URLs, durations, and coming-soon flags for three papers.",
  "frontend/src/content/gk.ts": "General Knowledge subject configuration with topics covering solar system, geography, history, social/economic systems, and science, each with associated video content.",
  "frontend/src/content/iq.ts": "IQ subject configuration with topics on verification tests, completion, classification, analogy, filing aptitude, and instruction-following, each with video resources.",
  "frontend/src/content/oldQuestions.ts": "Structured data for old exam questions organized by paper (first, second, third) and year, with Google Drive URLs and coming-soon indicators.",
  "frontend/src/content/secondPaper.ts": "Second paper subject configurations for office management and constitution topics, each with notes URLs and organized video content by subtopics.",
  "frontend/src/content/syllabus.ts": "Exports an array of syllabus links for different Pradesh regions in Nepal, each with an ID, title, and Google Drive URLs (or comingSoon flag).",
  "frontend/src/content/thirdPaper.ts": "Defines service management subject configuration with topics covering civil service, public service flow, governance acts, and related laws, each with associated video content.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useBookmarks.ts": "Manages video and note bookmarks with local storage persistence and cloud sync when authenticated, merging local and server bookmarks on login.",
  "frontend/src/hooks/useCountdownTimer.ts": "Provides countdown timer functionality with start, stop, reset controls and formatted time display, triggering a callback on completion.",
  "frontend/src/hooks/useExamManagement.ts": "React Query hook for managing mock exams with queries to fetch exams and mutations to add/delete exams via the backend actor.",
  "frontend/src/hooks/useGKManagement.ts": "Manages general knowledge (GK) content including topics, videos, and notes with CRUD operations through React Query mutations and queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity storage, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useIQManagement.ts": "Manages IQ test content including categories, videos, and notes with add/delete operations using React Query and the backend actor.",
  "frontend/src/hooks/useNotifications.ts": "Manages user notifications with localStorage persistence, providing default notifications for updates and exams with read/unread tracking.",
  "frontend/src/hooks/useOfflineLibrary.ts": "Manages offline library items (documents, videos, notes) with localStorage persistence, allowing add/remove operations.",
  "frontend/src/hooks/useOldQuestionsManagement.ts": "Provides React Query hooks for managing old exam questions with add/delete operations via backend actor.",
  "frontend/src/hooks/useQueries.ts": "Exports useIsAdmin hook that queries the backend actor to check if the current user has admin privileges.",
  "frontend/src/hooks/useSecondPaperManagement.ts": "Manages second paper content (topics, videos, notes) with React Query hooks for CRUD operations via backend actor.",
  "frontend/src/hooks/useStandaloneNoteManagement.ts": "Provides React Query hooks for managing standalone notes with add/delete operations via backend actor.",
  "frontend/src/hooks/useStandaloneVideoManagement.ts": "Provides React Query hooks for managing standalone videos with add/delete operations via backend actor.",
  "frontend/src/hooks/useSyllabusManagement.ts": "Manages syllabus entries with React Query hooks for add/delete operations via backend actor.",
  "frontend/src/hooks/useThirdPaperManagement.ts": "Manages third paper content (topics, videos, notes) with React Query hooks for CRUD operations via backend actor.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for theming (light/dark modes), color schemes, and animations for the application.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin panel page with tabbed interface for managing all content types (syllabus, GK, IQ, papers, exams, videos, notes, old questions). Protected by AdminGuard component.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying course carousel, three paper sections with subject cards (first, second, third paper), old questions link, and bottom navigation. Includes notification bell with unread count.",
  "frontend/src/pages/Exam.tsx": "Mock exam page with exam selection, countdown timer, and DriveViewer for displaying exam content. Plays sound and shows completion screen when time expires.",
  "frontend/src/pages/NotesBookmarks.tsx": "Displays user's bookmarked notes with delete functionality. Shows empty state message when no bookmarks exist.",
  "frontend/src/pages/Notifications.tsx": "Notifications page displaying categorized notifications (updates and exam dates) with read/unread status and mark-as-read functionality.",
  "frontend/src/pages/OfflineLibrary.tsx": "Offline library page showing saved items (notes and question papers) with options to open externally or remove from library.",
  "frontend/src/pages/OldQuestions.tsx": "Old questions page with three tabs (first, second, third paper) displaying question sets. Uses DriveViewer to display selected question papers.",
  "frontend/src/pages/SplashScreen.tsx": "Displays a full-screen splash screen with animated logo, app title 'Kharidar Tayari', Nepali subtitle, loading dots, and creator credit. Disables body scroll while mounted.",
  "frontend/src/pages/SubjectContent.tsx": "Renders subject content with resizable panels for videos and notes, includes video search, YouTube player, topic/video list with bookmarks, and responsive desktop/mobile layouts using tabs.",
  "frontend/src/pages/Syllabus.tsx": "Displays a list of syllabus items with navigation; clicking an item opens a DriveViewer to show PDF documents. Includes 'Coming Soon' state for unavailable items.",
  "frontend/src/pages/VideoBookmarks.tsx": "Shows user's bookmarked videos with search functionality and delete option. Displays empty state when no bookmarks exist and includes bottom navigation.",
  "frontend/src/types/content.ts": "Defines TypeScript interfaces for Video, Topic, and SubjectConfig structures used throughout the content management system.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for extracting, storing, and managing URL parameters and session storage, supporting both regular query strings and hash-based routing.",
  "frontend/src/utils/videoSearch.ts": "Implements case-insensitive filtering of topics and videos by keyword, returning only topics with matching titles or videos.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, extended theme for shadcn/ui components, container settings, animations, and plugin integrations.",
  "project_state.json": "Project metadata tracking architectural decisions, features, and pending requests to add prominent Add buttons with shadow/mix colors across all management sections for consistency."
}