{
  "backend/main.mo": "Motoko canister implementing user profiles and video/note bookmark storage with strict access control using AccessControl mixin.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, and test IDs with high-confidence metadata.",
  "frontend-file-summaries.txt": "Lookup file providing prewritten one‑sentence summaries for many frontend source files.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH theme variables for light/dark mode and base element styling.",
  "frontend/index.html": "HTML entrypoint mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app configuring all routes with TanStack Router and handling the splash screen before rendering the router.",
  "frontend/src/components/AppErrorBoundary.tsx": "Error boundary component that logs exceptions and shows a reloadable fallback UI.",
  "frontend/src/components/AppLogo.tsx": "Logo component that loads a custom logo with fallback to a generated image when missing.",
  "frontend/src/components/AuthControls.tsx": "Auth button component enabling Internet Identity login/logout with error handling and react-query cache clearing.",
  "frontend/src/components/BottomNav.tsx": "Renders a fixed bottom navigation bar with four routes and highlights the active path.",
  "frontend/src/components/DriveViewer.tsx": "Displays Google Drive documents via embed or fallback and supports offline saving and direct opening.",
  "frontend/src/components/SoundPlayer.tsx": "Plays a notification sound when triggered and calls an optional end callback.",
  "frontend/src/components/TopicVideoList.tsx": "Shows topic-grouped video lists with selection highlighting and bookmark toggling.",
  "frontend/src/components/YouTubePlayer.tsx": "Embeds YouTube videos or playlists by converting URLs to embed format.",
  "frontend/src/content/exams.ts": "Defines exam sets with IDs, titles, URLs, durations, and coming-soon flags.",
  "frontend/src/content/gk.ts": "Provides General Knowledge subject config with notes and detailed topic video lists.",
  "frontend/src/content/iq.ts": "Provides IQ subject config with categorized topics and multiple training videos.",
  "frontend/src/content/oldQuestions.ts": "Lists old exam questions by paper with IDs, titles, Drive URLs, and coming-soon markers.",
  "frontend/src/content/secondPaper.ts": "Defines two SubjectConfig objects containing office management and constitution topics with associated video lists and notes URLs.",
  "frontend/src/content/syllabus.ts": "Exports an array of syllabus link objects for different regions and parts, some with comingSoon flags.",
  "frontend/src/content/thirdPaper.ts": "Provides SubjectConfig for service management including topics, notes URL, and associated instructional videos.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useBookmarks.ts": "Manages local and cloud-synced video and note bookmarks, merging local storage with backend data when authenticated.",
  "frontend/src/hooks/useCountdownTimer.ts": "Implements a countdown timer hook with start, stop, reset, and formatted time output.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login, logout, and identity persistence using Dfinity AuthClient.",
  "frontend/src/hooks/useNotifications.ts": "Loads, stores, and updates user notifications with localStorage persistence and unread count.",
  "frontend/src/hooks/useOfflineLibrary.ts": "Handles offline library items by storing, adding, and removing entries in localStorage.",
  "frontend/src/index.css": "Sets Tailwind layers, defines light/dark theme color variables, global styles, utilities, and animations.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard with subject cards, course previews, header actions, and navigation.",
  "frontend/src/pages/Exam.tsx": "Implements exam selection, timed exam viewer, completion screen, and timer logic integration.",
  "frontend/src/pages/NotesBookmarks.tsx": "Displays bookmarked notes with delete actions and navigation controls.",
  "frontend/src/pages/Notifications.tsx": "Shows categorized notifications and marks them as read on interaction.",
  "frontend/src/pages/OfflineLibrary.tsx": "Lists offline-saved items with open and delete actions.",
  "frontend/src/pages/OldQuestions.tsx": "Displays old exam papers in tabbed lists and opens selected papers in a Drive viewer.",
  "frontend/src/pages/SplashScreen.tsx": "Shows an animated splash screen with logo and tagline while temporarily disabling page scrolling.",
  "frontend/src/pages/SubjectContent.tsx": "Renders subject videos, notes, search, and bookmarks with a resizable layout and YouTube/Drive viewers.",
  "frontend/src/pages/Syllabus.tsx": "Lists syllabus items and opens selected ones in a Drive viewer, with support for coming‑soon entries.",
  "frontend/src/pages/VideoBookmarks.tsx": "Displays, searches, and removes bookmarked videos with navigation and auth controls.",
  "frontend/src/types/content.ts": "Defines TypeScript interfaces for videos, topics, and subject configuration.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL parameters with session persistence support.",
  "frontend/src/utils/videoSearch.ts": "Filters topics and videos by keyword, returning only matching topics or videos.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom color system using oklch vars, extended animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state describing requirements for a Nepali exam-prep mobile app, listing features, issues, architecture notes, and required images."
}