{
  "backend/main.mo": "Main Motoko actor defining types for syllabus, GK, IQ, second/third paper content, exams, videos, notes, and user profiles; includes authorization mixin, storage for all content types, bookmark maps, and a comment system with user permission checks.",
  "feature_evidence.json": "Feature evidence report documenting the removal of 'Add' buttons from all admin management forms (Syllabus, GK, IQ, Second Paper, Third Paper, Exams, Videos, Notes) with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, content configuration, styling, hooks for bookmarks and authentication, pages for dashboard/subjects/exams/bookmarks, and UI components with Nepali translations and warm neutral backgrounds.",
  "frontend/index.css": "Global stylesheet with Tailwind directives, OKLCH color system variables for light/dark themes, and custom styling for borders and backgrounds.",
  "frontend/index.html": "HTML entry point with viewport meta tag, title for Tayari exam-preparation app, and script tag loading the React app from main.tsx.",
  "frontend/src/App.tsx": "Main app component with TanStack Router configuration defining routes for dashboard, syllabus, subjects (GK, IQ, second/third paper topics), bookmarks, old questions, exams, offline library, and admin panel, wrapped in error boundary with 3-second splash screen.",
  "frontend/src/components/admin/ExamManagementForm.tsx": "Admin interface to view and delete existing exams, displaying title, duration, description, and PDF URL.",
  "frontend/src/components/admin/GKManagementForm.tsx": "Admin interface with tabs to manage (view and delete) GK topics and videos separately.",
  "frontend/src/components/admin/IQManagementForm.tsx": "Admin interface with tabs to manage (view and delete) IQ categories and videos separately.",
  "frontend/src/components/admin/SecondPaperManagementForm.tsx": "Admin component with tabs to manage second paper topics, videos, and notes with delete functionality using the useSecondPaperManagement hook.",
  "frontend/src/components/admin/StandaloneNoteManagementForm.tsx": "Admin component to display and delete standalone notes with confirmation dialogs and toast notifications.",
  "frontend/src/components/admin/StandaloneVideoManagementForm.tsx": "Admin component to display and delete standalone videos with confirmation dialogs and toast notifications.",
  "frontend/src/components/admin/SyllabusManagementForm.tsx": "Admin component to manage syllabus entries, displaying title, description, drive URL, and published status with delete functionality.",
  "frontend/src/components/admin/ThirdPaperManagementForm.tsx": "Admin component with tabs to manage third paper topics, videos, and notes with delete functionality using the useThirdPaperManagement hook.",
  "frontend/src/components/AdminGuard.tsx": "Authentication and authorization guard component that checks user identity and admin status, displaying loading states, login prompts, or access denied messages before rendering protected admin content.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary class component that catches render errors, logs them with full stack traces, and displays a user-friendly fallback UI with error message and reload button.",
  "frontend/src/components/AppLogo.tsx": "Logo component displaying the 3D education globe PNG with automatic fallback to Thah Study logo on load error.",
  "frontend/src/components/AuthControls.tsx": "Authentication control button component that toggles between login and logout states, handles Internet Identity authentication, and clears query cache on logout.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar component with Home, Video, Notes, Exam tabs (and Admin for admins), using Nepali labels and highlighting the active route.",
  "frontend/src/components/CourseImageCarousel.tsx": "Auto-advancing image carousel with manual navigation controls and dot indicators for course images.",
  "frontend/src/components/DriveViewer.tsx": "Embeds Google Drive files/folders with fallback to external link, includes offline save and download functionality.",
  "frontend/src/components/SoundPlayer.tsx": "Audio player component that plays an exam finish bell sound when triggered, with error handling.",
  "frontend/src/components/TopicVideoList.tsx": "Displays a scrollable list of videos grouped by topics with selection highlighting and bookmark toggle functionality.",
  "frontend/src/components/YouTubePlayer.tsx": "Embeds YouTube videos or playlists by parsing various URL formats into iframe embed URLs.",
  "frontend/src/content/exams.ts": "Defines exam sets for three papers (first, second, third) with titles in Nepali, Google Drive URLs, durations, and coming soon flags.",
  "frontend/src/content/gk.ts": "Defines General Knowledge subject configuration with topics covering solar system, world/Nepal geography, world/Nepal history, social/economic aspects, and science/technology with associated video URLs.",
  "frontend/src/content/iq.ts": "Defines IQ test content configuration with 6 topics (Verification, Completion, Classification, Analogy, Filing Aptitude, Follow Instructions) and associated video links for each topic.",
  "frontend/src/content/oldQuestions.ts": "Contains old question paper data organized by first, second, and third papers with years (2078-2083) and Google Drive links, including province-specific papers.",
  "frontend/src/content/secondPaper.ts": "Exports two subject configurations: Office Management (कार्यालय व्यावस्थापन) and Constitution (संविधान), each with topics, video links, and notes URLs.",
  "frontend/src/content/syllabus.ts": "Exports syllabus links array containing Google Drive URLs for all syllabus parts and province-specific syllabi (Koshi, Madhesh, Bagmati, Gandaki, Lumbini, Karnali, Sudurpashchim).",
  "frontend/src/content/thirdPaper.ts": "Defines Service Management (सेवा व्यावस्थापन) subject configuration with 9 topics covering civil service, public service flow, governance acts, and related legislation with video links.",
  "frontend/src/hooks/useActor.ts": "React hook that manages backend actor creation with Internet Identity authentication, handles admin token initialization, and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useBookmarks.ts": "Custom hook managing video and note bookmarks with local storage persistence and cloud sync via backend actor when authenticated, merging local and server data.",
  "frontend/src/hooks/useCountdownTimer.ts": "React hook providing countdown timer functionality with start, stop, reset controls and formatted time display, supporting optional completion callback.",
  "frontend/src/hooks/useExamManagement.ts": "React hook for managing mock exams with queries and mutations to fetch, add, and delete exam data via the backend actor.",
  "frontend/src/hooks/useGKManagement.ts": "React hook for managing General Knowledge topics and videos with CRUD operations through the backend actor and query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient configuration.",
  "frontend/src/hooks/useIQManagement.ts": "React hook for managing IQ categories and videos with queries and mutations for adding and deleting content via the backend actor.",
  "frontend/src/hooks/useNotifications.ts": "React hook for managing user notifications stored in localStorage, with default notifications for updates and exams, and read/unread tracking.",
  "frontend/src/hooks/useOfflineLibrary.ts": "React hook for managing offline library items (documents, videos, notes) stored in localStorage with add and remove functionality.",
  "frontend/src/hooks/useQueries.ts": "React hook that queries the backend actor to check if the current caller has admin privileges.",
  "frontend/src/hooks/useSecondPaperManagement.ts": "React hook for managing Second Paper content (topics, videos, notes) with comprehensive CRUD operations via the backend actor.",
  "frontend/src/hooks/useStandaloneNoteManagement.ts": "React hook for managing standalone notes with queries and mutations to fetch, add, and delete notes through the backend actor.",
  "frontend/src/hooks/useStandaloneVideoManagement.ts": "React hook for managing standalone videos with queries and mutations to fetch, add, and delete videos via the backend actor.",
  "frontend/src/hooks/useSyllabusManagement.ts": "React hook for managing syllabus entries with queries and mutations to fetch, add, and delete entries through the backend actor.",
  "frontend/src/hooks/useThirdPaperManagement.ts": "Custom React hook that provides queries and mutations for managing third paper topics, videos, and notes using TanStack Query and an actor backend.",
  "frontend/src/index.css": "Global CSS file with Tailwind directives, CSS custom properties for theming (light/dark mode), and keyframe animations for UI transitions.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin panel page with tabbed interface for managing syllabus, GK, IQ, second/third paper content, exams, videos, and notes, protected by AdminGuard.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying PSC exam preparation subjects organized by paper (first, second, third) with navigation cards, course carousel, and notification bell.",
  "frontend/src/pages/Exam.tsx": "Exam page with countdown timer, exam selection interface, and DriveViewer for displaying exam content with sound notification on completion.",
  "frontend/src/pages/NotesBookmarks.tsx": "Page displaying user's bookmarked notes with ability to remove bookmarks, showing empty state when no bookmarks exist.",
  "frontend/src/pages/Notifications.tsx": "Displays notifications grouped by category (updates and exams) with ability to mark as read. Uses a sticky header with back navigation and shows unread items with a badge.",
  "frontend/src/pages/OfflineLibrary.tsx": "Shows a list of offline-saved items (notes and question papers) with options to view or delete them. Displays an empty state when no items are saved.",
  "frontend/src/pages/OldQuestions.tsx": "Displays old exam questions organized in three tabs (first, second, third paper) with clickable cards that open a DriveViewer. Handles coming-soon states and missing URLs.",
  "frontend/src/pages/SplashScreen.tsx": "Animated splash screen with logo, app title in Nepali, and loading animation. Includes creator credit and prevents body scrolling while visible.",
  "frontend/src/pages/SubjectContent.tsx": "Main subject content page with resizable panels for videos and notes, video search functionality, and bookmark support. Provides both desktop (split-panel) and mobile (tabbed) layouts.",
  "frontend/src/pages/Syllabus.tsx": "Lists syllabus items as clickable cards that open a DriveViewer when selected. Handles coming-soon states and provides back navigation.",
  "frontend/src/pages/VideoBookmarks.tsx": "Displays bookmarked videos with search functionality and delete options. Shows empty state when no bookmarks exist and includes bottom navigation.",
  "frontend/src/types/content.ts": "TypeScript type definitions for content structure including Video, Topic, and SubjectConfig interfaces used throughout the app.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/src/utils/videoSearch.ts": "Provides a function to filter topics and videos by keyword search, returning only topics with matching titles or videos.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata tracking a feature request to remove 'Add' buttons from admin panel management forms across multiple sections (Syllabus, GK, IQ, Papers, Exams, Videos, Notes)."
}