{
  "backend/main.mo": "Motoko backend actor handling authorization, user profiles, and storing video/note bookmarks per user with permission checks.",
  "feature_evidence.json": "Feature evidence report listing three UI-related features with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files describing their purpose and behavior across the project.",
  "frontend/index.css": "Tailwind base styles defining light/dark theme CSS variables and applying global background and text settings.",
  "frontend/index.html": "Base HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React router setup defining all routes and pages, with splash-screen handling and an AppErrorBoundary wrapper.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that logs errors and displays a reloadable fallback UI.",
  "frontend/src/components/AppLogo.tsx": "Logo component showing a generated globe image with fallback to the Thah Study logo on load failure.",
  "frontend/src/components/AuthControls.tsx": "Authentication control button handling login/logout via Internet Identity with error recovery.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar with Nepali labels and active-state highlighting for core app sections.",
  "frontend/src/components/CourseImageCarousel.tsx": "Image carousel with auto‑advance, manual navigation buttons, and slide indicators.",
  "frontend/src/components/DriveViewer.tsx": "Displays Google Drive files with embed preview, download handling, and offline save support.",
  "frontend/src/components/SoundPlayer.tsx": "Simple audio player that auto‑plays a fixed sound when triggered.",
  "frontend/src/components/TopicVideoList.tsx": "Scrollable list of topic‑grouped videos with selection highlighting and bookmark toggling.",
  "frontend/src/components/YouTubePlayer.tsx": "Generates YouTube embed URLs from various link formats and renders a responsive iframe player.",
  "frontend/src/content/exams.ts": "Defines exam sets with IDs, titles, durations, and Drive URLs, including some marked coming soon.",
  "frontend/src/content/gk.ts": "General Knowledge subject config with notes and multiple topics containing YouTube video lists.",
  "frontend/src/content/iq.ts": "IQ subject config organizing several test categories, each with multiple YouTube video links.",
  "frontend/src/content/oldQuestions.ts": "Lists old exam questions for three papers, each year containing optional Drive URLs or coming‑soon flags.",
  "frontend/src/content/secondPaper.ts": "Defines subject configs for office management and constitution, listing topics with associated video URLs and notes.",
  "frontend/src/content/syllabus.ts": "Exports an array of syllabus links for various provinces and parts, some with drive URLs and one marked coming soon.",
  "frontend/src/content/thirdPaper.ts": "Provides service management subject configuration with topics and multiple related video resources.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the actor updates.",
  "frontend/src/hooks/useBookmarks.ts": "Manages local and cloud-synced video and note bookmarks, merging backend and local data after authentication.",
  "frontend/src/hooks/useCountdownTimer.ts": "Implements a countdown timer hook with start, stop, reset, and formatted time output.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, stored identity loading, and exposing authentication state.",
  "frontend/src/hooks/useNotifications.ts": "Loads, stores, and updates user notifications with local persistence and unread tracking.",
  "frontend/src/hooks/useOfflineLibrary.ts": "Manages a locally stored offline library of documents, videos, and notes with add/remove functions.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables for light/dark modes, global styles, utility classes, and custom animations.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity context, then renders App.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard UI with subject categories, header, notifications badge, and course carousel.",
  "frontend/src/pages/Exam.tsx": "Implements exam selection and timed exam flow with countdown, DriveViewer display, and completion handling.",
  "frontend/src/pages/NotesBookmarks.tsx": "Shows user’s bookmarked notes with delete support and navigation controls.",
  "frontend/src/pages/Notifications.tsx": "Displays categorized notifications and allows marking items as read.",
  "frontend/src/pages/OfflineLibrary.tsx": "Lists downloaded offline items with open and delete actions.",
  "frontend/src/pages/OldQuestions.tsx": "Displays old exam question sets in tabbed lists and opens selected items in a Drive viewer.",
  "frontend/src/pages/SplashScreen.tsx": "Shows an animated splash screen with logo and titles while temporarily disabling page scrolling.",
  "frontend/src/pages/SubjectContent.tsx": "Renders subject-specific videos, search, bookmarking, and notes with a responsive layout and resizable panels.",
  "frontend/src/pages/Syllabus.tsx": "Lists syllabus items and opens selected entries in a Drive viewer, with support for coming-soon items.",
  "frontend/src/pages/VideoBookmarks.tsx": "Displays and filters bookmarked videos, allowing removal and navigation back to the main page.",
  "frontend/src/types/content.ts": "Defines TypeScript interfaces for videos, topics, and subject configuration.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session parameters, including hash-based parsing.",
  "frontend/src/utils/videoSearch.ts": "Implements keyword-based filtering of topics and videos, returning only relevant matches.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, custom OKLCH color system, animations, container settings, and loading typography, container-queries, and animate plugins.",
  "project_state.json": "JSON snapshot of app requirements, architecture notes, issues, and existing features for a Nepali exam‑prep mobile app with videos, notes, mock exams, and themed UI."
}