{
  "kind": "build_request",
  "title": "Replace splash screen logo, remove dashboard header logo, and shrink course card height",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-38",
      "text": "Update the Splash Screen to remove the current AppLogo-based logo and instead render a new static PNG logo showing a person preparing for PSC with many books in front. Display the tagline text exactly \"सफलता को साथी\" under the logo (replacing the current tagline text).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "पहिलो पेज को logo remove garnus tes thaunma psc ko tayari gare rayako ra aagadi dharai book rakhako png logo halnus tala सफलता को साथी लेख्नुहोस"
        ]
      },
      "acceptanceCriteria": [
        "On the splash screen, the logo shown is the new PSC-preparation PNG (not the current AppLogo globe/education logo).",
        "The splash screen tagline text is exactly \"सफलता को साथी\" (same spelling and spacing).",
        "No other splash screen content (e.g., title timing/navigation behavior) regresses."
      ]
    },
    {
      "id": "REQ-39",
      "text": "On the main Dashboard header, remove the small earth/globe-with-book logo (the AppLogo component) so it is no longer displayed in the header row.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "main page ko sano earth ko mathi book rakhako logo remove garnus"
        ]
      },
      "acceptanceCriteria": [
        "The Dashboard header no longer renders the AppLogo image next to the avatar/title.",
        "Header layout remains aligned and visually balanced after removing the logo."
      ]
    },
    {
      "id": "REQ-40",
      "text": "Make the \"खरिदार तयारी कोर्स\" course card/box on the Dashboard smaller in vertical size by reducing its effective height (primarily by bringing the bottom edge/spacing upward) while keeping the left, right, and top visual edges consistent with the current design.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "खरीदार तयारी कोर्स लेखको box ko size सानो गर्नुहोस left, right र mathi को line seme tara tala ko line halka माथि ल्याउनु paro size  सानो गर्नाको लागि"
        ]
      },
      "acceptanceCriteria": [
        "The Dashboard course card is visibly shorter in height than before (less vertical padding/space), without changing its overall width.",
        "The card’s left/right/top visual boundaries remain consistent with the current style; only the vertical size is reduced.",
        "Course carousel and course text remain readable and not clipped on common mobile viewport sizes."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Do not route generated/static images through the backend; serve them from frontend/public/assets/generated."
  ],
  "nonGoals": [
    "Do not change bookmark sync, exams, old questions, or other learning content modules.",
    "Do not redesign the overall app theme beyond the specific UI adjustments requested."
  ],
  "imageRequirements": {
    "required": [
      "PSC exam preparation logo illustration: person studying for PSC with many books in front, PNG with transparent or clean background (psc-study-logo.dim_512x512.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}