{
  "kind": "build_request",
  "title": "Update profile header title to 'Tayari' and add PSC-preparation profile image",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-35",
      "text": "Update the top profile/header screen text so that anywhere the app currently shows the phrase \"design by build tayari\" it instead shows exactly \"Tayari\" (and does not include any other words around it).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Yasko screen name  mathi profile ma design by build tayari lekhako thau ma Matri \"Tayari\" लेख्नुहोस"
        ]
      },
      "acceptanceCriteria": [
        "The UI no longer displays the text \"design by build tayari\" anywhere in the app UI.",
        "The affected header/title renders exactly \"Tayari\" (case-sensitive) with no additional prefix/suffix text."
      ]
    },
    {
      "id": "REQ-36",
      "text": "Add a profile image on the profile/header area that visually looks like someone preparing for PSC, and ensure it is displayed as the profile avatar/image in that profile area (with sensible cropping such as a circle or rounded avatar).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "profile image psc तयारी garirayako जस्तो haldinus"
        ]
      },
      "acceptanceCriteria": [
        "A new static image asset representing a PSC-preparation scene is added under frontend/public/assets/generated and is used as the profile image in the profile/header area.",
        "The profile image renders consistently without layout overflow on common mobile widths."
      ]
    },
    {
      "id": "REQ-37",
      "text": "Wire the newly generated PSC-preparation profile image asset as a static frontend asset (do not fetch it from the backend), and reference it via a stable /assets/generated/... path from the profile UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "profile image psc तयारी garirayako जस्तो haldinus"
        ]
      },
      "acceptanceCriteria": [
        "The profile UI references the image via a /assets/generated/... URL.",
        "No backend APIs or canister calls are introduced for serving the profile image."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (read-only UI components).",
    "Do not modify files listed as immutable in SYSTEM_CONTEXT (compose them instead).",
    "Keep backend architecture as single-actor; no backend changes are required for this request."
  ],
  "nonGoals": [
    "Do not change dashboard header branding (AppLogo + 'Tayari') beyond what is necessary for the profile/header area mentioned by the user.",
    "Do not implement user-uploaded profile photos or backend-stored avatars as part of this change."
  ],
  "imageRequirements": {
    "required": [
      "A studying person preparing for a public service exam scene, clean modern illustration style, bright background, no text (psc-profile.dim_512x512.png)"
    ],
    "edits": []
  }
}