{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Splash logo replacement, Dashboard header logo removal, and shorter course card",
  "requirements": [
    {
      "id": "REQ-38",
      "summary": "Replace Splash Screen AppLogo with the new static PSC-preparation PNG and update tagline text to exactly \"सफलता को साथी\".",
      "acceptanceCriteria": [
        "On the splash screen, the logo shown is the new PSC-preparation PNG (not the current AppLogo globe/education logo).",
        "The splash screen tagline text is exactly \"सफलता को साथी\" (same spelling and spacing).",
        "No other splash screen content (e.g., title timing/navigation behavior) regresses."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/psc-study-logo.dim_512x512.png",
          "operation": "create",
          "description": "Add the required generated static PNG asset for the new splash logo (PSC exam preparation logo illustration). Keep it served directly from the frontend public assets per constraints."
        },
        {
          "path": "frontend/src/pages/SplashScreen.tsx",
          "operation": "modify",
          "description": "Remove AppLogo usage on the splash screen and render the static image from frontend/public/assets/generated/psc-study-logo.dim_512x512.png. Update the tagline text to exactly \"सफलता को साथी\" while preserving existing splash timing, animations, and scroll-lock behavior."
        }
      ]
    },
    {
      "id": "REQ-39",
      "summary": "Remove the AppLogo from the main Dashboard header row while keeping the header aligned and balanced.",
      "acceptanceCriteria": [
        "The Dashboard header no longer renders the AppLogo image next to the avatar/title.",
        "Header layout remains aligned and visually balanced after removing the logo."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Remove the AppLogo import and the <AppLogo /> element from the header row. Adjust spacing/alignment classes in the header container if needed so the Avatar and title remain visually balanced."
        }
      ]
    },
    {
      "id": "REQ-40",
      "summary": "Reduce the vertical size of the \"खरिदार तयारी कोर्स\" course card on the Dashboard without changing its width or the left/right/top visual edges.",
      "acceptanceCriteria": [
        "The Dashboard course card is visibly shorter in height than before (less vertical padding/space), without changing its overall width.",
        "The card’s left/right/top visual boundaries remain consistent with the current style; only the vertical size is reduced.",
        "Course carousel and course text remain readable and not clipped on common mobile viewport sizes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Tune the course Card layout to be shorter by reducing vertical padding and/or internal vertical spacing (e.g., Card padding and space-y/margins around the carousel) while keeping the card’s gradient, width, and top/left/right boundaries consistent. Ensure carousel aspect ratio remains intact and text is not clipped on mobile."
        }
      ]
    }
  ]
}